In [1]:
import pandas as pd

In [2]:
def update_df(file_name):
    #read dataframe
    df = pd.read_excel(file_name)

    df.loc[df['name']=='jerin','age'] = 21

    df.to_excel(file_name,index=False)

    return df

In [4]:
update_df("data.xlsx")

       name  age        city
0     steve   25     chennai
1    sanjay   26     madurai
2     jerin   21  coimbatore
3  saravana   28       salem